app/controllers/users_controller.rb

  def searchUser
    user = User.where(name: params[:u])
---
SELECT "users".* FROM "users" WHERE "users"."name" = $1  [["name", "mekahay"]]